chayuto/ws-ESP32-S3-Touch-AMOLED-1.8/projects/06_sensorous/sdkconfig.defaults
# 06_sensorous - measure everything on this board and write it to the card.
# Board: Waveshare ESP32-S3-Touch-AMOLED-1.8 (ESP32-S3R8, 16 MB quad flash, 8 MB OPI PSRAM)
#
# Credentials are NOT here. Put CONFIG_SENSOROUS_WIFI_SSID / _PASSWORD in
# sdkconfig.defaults.local, which is gitignored, and layer it in at build time.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Full 240 MHz. ESP-IDF otherwise boots the S3 at 160 MHz.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# ---------------------------------------------------------------------------
# Radio. Both stacks are resident at once: Wi-Fi for the scan and the export
# server, NimBLE as an observer. They are never *scanning* at the same time
# (see blescan.c), but they do share the antenna, so software coexistence is
# mandatory rather than optional here.
# ---------------------------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# A scan wants somewhere to put the results; 96 APs is more than a suburb has.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=24
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_TCP_WND_DEFAULT=5760
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Long names on the card: sensors-20260909-142233.jsonl does not fit 8.3.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Logging, agentic first. DEBUG compiled in, INFO default, own tags raised at boot.
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=n
# The SD log hook runs on every task that logs, including the system event task.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
